src/main/resources/xml/accommodationFulfillmentServicePort/upgradePartyMix/upgradePartyMix.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://accommodation.transferobject.fulfillment.lodging.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:upgradePartyMix>
         <request>
            <!--Optional:-->
            <travelComponentGroupingId>?</travelComponentGroupingId>
            <!--Optional:-->
            <locationId>?</locationId>
            <!--Optional:-->
            <upgradeReason>?</upgradeReason>
            <!--Optional:-->
            <communicationChannel>?</communicationChannel>
            <!--Optional:-->
            <salesChannel>?</salesChannel>
            <!--Zero or more repetitions:-->
            <updatePartyMixDetail>
               <!--Optional:-->
               <ageTypeChanged>?</ageTypeChanged>
               <!--Optional:-->
               <deleted>?</deleted>
               <!--Optional:-->
               <added>?</added>
               <!--Optional:-->
               <guestReferenceDetail>
                  <age>?</age>
                  <!--Optional:-->
                  <ageType>?</ageType>
                  <!--Optional:-->
                  <guest>
                     <!--Optional:-->
                     <suffix>?</suffix>
                     <!--Optional:-->
                     <title>?</title>
                     <!--Optional:-->
                     <firstName>?</firstName>
                     <!--Optional:-->
                     <lastName>?</lastName>
                     <!--Optional:-->
                     <middleName>?</middleName>
                     <partyId>?</partyId>
                     <!--Zero or more repetitions:-->
                     <phoneDetails>
                        <locatorId>?</locatorId>
                        <guestLocatorId>?</guestLocatorId>
                        <!--Optional:-->
                        <locatorUseType>?</locatorUseType>
                        <primary>?</primary>
                        <!--Optional:-->
                        <deviceType>?</deviceType>
                        <extension>?</extension>
                        <!--Optional:-->
                        <number>?</number>
                     </phoneDetails>
                     <!--Zero or more repetitions:-->
                     <addressDetails>
                        <locatorId>?</locatorId>
                        <guestLocatorId>?</guestLocatorId>
                        <!--Optional:-->
                        <locatorUseType>?</locatorUseType>
                        <primary>?</primary>
                        <!--Optional:-->
                        <addressLine1>?</addressLine1>
                        <!--Optional:-->
                        <addressLine2>?</addressLine2>
                        <!--Optional:-->
                        <city>?</city>
                        <!--Optional:-->
                        <country>?</country>
                        <!--Optional:-->
                        <postalCode>?</postalCode>
                        <!--Optional:-->
                        <state>?</state>
                        <!--Optional:-->
                        <regionName>?</regionName>
                     </addressDetails>
                     <!--Zero or more repetitions:-->
                     <emailDetails>
                        <locatorId>?</locatorId>
                        <guestLocatorId>?</guestLocatorId>
                        <!--Optional:-->
                        <locatorUseType>?</locatorUseType>
                        <primary>?</primary>
                        <!--Optional:-->
                        <address>?</address>
                     </emailDetails>
                     <!--Optional:-->
                     <membershipDetail>
                        <!--Optional:-->
                        <expirationDate>?</expirationDate>
                        <!--Optional:-->
                        <memberShipType>?</memberShipType>
                        <!--Optional:-->
                        <membershipId>?</membershipId>
                        <policyId>?</policyId>
                        <productChannelId>?</productChannelId>
                        <!--Optional:-->
                        <guestMembershipId>?</guestMembershipId>
                     </membershipDetail>
                     <doNotMailIndicator>?</doNotMailIndicator>
                     <doNotPhoneIndicator>?</doNotPhoneIndicator>
                     <!--Optional:-->
                     <preferredLanguage>?</preferredLanguage>
                     <dclGuestId>?</dclGuestId>
                     <!--Optional:-->
                     <dclTransferCode>?</dclTransferCode>
                     <guestId>?</guestId>
                     <!--Optional:-->
                     <guestTypeName>?</guestTypeName>
                     <!--Optional:-->
                     <favouriteCharacter>?</favouriteCharacter>
                     <active>?</active>
                     <!--Zero or more repetitions:-->
                     <guestIdReferences>
                        <type>?</type>
                        <value>?</value>
                     </guestIdReferences>
                     <!--Optional:-->
                     <gender>?</gender>
                     <!--Optional:-->
                     <dob>?</dob>
                  </guest>
                  <!--Optional:-->
                  <purposeOfVisit>?</purposeOfVisit>
                  <!--Optional:-->
                  <role>?</role>
                  <correlationID>?</correlationID>
                  <!--Zero or more repetitions:-->
                  <experienceMediaDetails>
                     <id>?</id>
                     <mediaCustomization>
                        <optOut>?</optOut>
                        <!--Optional:-->
                        <optOutReason>?</optOutReason>
                        <!--Optional:-->
                        <color>?</color>
                        <!--Optional:-->
                        <printedName>?</printedName>
                        <!--Optional:-->
                        <optOutAvailable>?</optOutAvailable>
                     </mediaCustomization>
                  </experienceMediaDetails>
               </guestReferenceDetail>
               <!--Optional:-->
               <ticketDetail>
                  <adultTicket>?</adultTicket>
                  <hardTicketedEvent>?</hardTicketedEvent>
                  <!--Optional:-->
                  <auditDetail>
                     <!--Optional:-->
                     <createdBy>?</createdBy>
                     <!--Optional:-->
                     <createdDate>?</createdDate>
                     <!--Optional:-->
                     <updatedBy>?</updatedBy>
                     <!--Optional:-->
                     <updatedDate>?</updatedDate>
                     <!--Optional:-->
                     <status>?</status>
                  </auditDetail>
                  <baseAdmissionProductId>?</baseAdmissionProductId>
                  <!--Optional:-->
                  <code>?</code>
                  <componentId>?</componentId>
                  <dayCount>?</dayCount>
                  <!--Zero or more repetitions:-->
                  <externalReferences>
                     <!--Optional:-->
                     <externalReferenceType>?</externalReferenceType>
                     <!--Optional:-->
                     <externalReferenceCode>?</externalReferenceCode>
                     <!--Optional:-->
                     <externalReferenceNumber>?</externalReferenceNumber>
                     <!--Optional:-->
                     <externalReferenceSource>?</externalReferenceSource>
                  </externalReferences>
                  <!--Zero or more repetitions:-->
                  <featureDetails>
                     <featureId>?</featureId>
                     <!--Optional:-->
                     <featureName>?</featureName>
                  </featureDetails>
                  <!--Optional:-->
                  <guestReference>
                     <age>?</age>
                     <!--Optional:-->
                     <ageType>?</ageType>
                     <!--Optional:-->
                     <guest>
                        <!--Optional:-->
                        <suffix>?</suffix>
                        <!--Optional:-->
                        <title>?</title>
                        <!--Optional:-->
                        <firstName>?</firstName>
                        <!--Optional:-->
                        <lastName>?</lastName>
                        <!--Optional:-->
                        <middleName>?</middleName>
                        <partyId>?</partyId>
                        <!--Zero or more repetitions:-->
                        <phoneDetails>
                           <locatorId>?</locatorId>
                           <guestLocatorId>?</guestLocatorId>
                           <!--Optional:-->
                           <locatorUseType>?</locatorUseType>
                           <primary>?</primary>
                           <!--Optional:-->
                           <deviceType>?</deviceType>
                           <extension>?</extension>
                           <!--Optional:-->
                           <number>?</number>
                        </phoneDetails>
                        <!--Zero or more repetitions:-->
                        <addressDetails>
                           <locatorId>?</locatorId>
                           <guestLocatorId>?</guestLocatorId>
                           <!--Optional:-->
                           <locatorUseType>?</locatorUseType>
                           <primary>?</primary>
                           <!--Optional:-->
                           <addressLine1>?</addressLine1>
                           <!--Optional:-->
                           <addressLine2>?</addressLine2>
                           <!--Optional:-->
                           <city>?</city>
                           <!--Optional:-->
                           <country>?</country>
                           <!--Optional:-->
                           <postalCode>?</postalCode>
                           <!--Optional:-->
                           <state>?</state>
                           <!--Optional:-->
                           <regionName>?</regionName>
                        </addressDetails>
                        <!--Zero or more repetitions:-->
                        <emailDetails>
                           <locatorId>?</locatorId>
                           <guestLocatorId>?</guestLocatorId>
                           <!--Optional:-->
                           <locatorUseType>?</locatorUseType>
                           <primary>?</primary>
                           <!--Optional:-->
                           <address>?</address>
                        </emailDetails>
                        <!--Optional:-->
                        <membershipDetail>
                           <!--Optional:-->
                           <expirationDate>?</expirationDate>
                           <!--Optional:-->
                           <memberShipType>?</memberShipType>
                           <!--Optional:-->
                           <membershipId>?</membershipId>
                           <policyId>?</policyId>
                           <productChannelId>?</productChannelId>
                           <!--Optional:-->
                           <guestMembershipId>?</guestMembershipId>
                        </membershipDetail>
                        <doNotMailIndicator>?</doNotMailIndicator>
                        <doNotPhoneIndicator>?</doNotPhoneIndicator>
                        <!--Optional:-->
                        <preferredLanguage>?</preferredLanguage>
                        <dclGuestId>?</dclGuestId>
                        <!--Optional:-->
                        <dclTransferCode>?</dclTransferCode>
                        <guestId>?</guestId>
                        <!--Optional:-->
                        <guestTypeName>?</guestTypeName>
                        <!--Optional:-->
                        <favouriteCharacter>?</favouriteCharacter>
                        <active>?</active>
                        <!--Zero or more repetitions:-->
                        <guestIdReferences>
                           <type>?</type>
                           <value>?</value>
                        </guestIdReferences>
                        <!--Optional:-->
                        <gender>?</gender>
                        <!--Optional:-->
                        <dob>?</dob>
                     </guest>
                     <!--Optional:-->
                     <purposeOfVisit>?</purposeOfVisit>
                     <!--Optional:-->
                     <role>?</role>
                     <correlationID>?</correlationID>
                     <!--Zero or more repetitions:-->
                     <experienceMediaDetails>
                        <id>?</id>
                        <mediaCustomization>
                           <optOut>?</optOut>
                           <!--Optional:-->
                           <optOutReason>?</optOutReason>
                           <!--Optional:-->
                           <color>?</color>
                           <!--Optional:-->
                           <printedName>?</printedName>
                           <!--Optional:-->
                           <optOutAvailable>?</optOutAvailable>
                        </mediaCustomization>
                     </experienceMediaDetails>
                  </guestReference>
                  <partOfPackage>?</partOfPackage>
                  <!--Optional:-->
                  <price>
                     <currency>?</currency>
                     <amount>?</amount>
                  </price>
                  <selectable>?</selectable>
                  <!--Optional:-->
                  <status>?</status>
                  <!--Optional:-->
                  <ticketDescription>?</ticketDescription>
                  <!--Optional:-->
                  <totalAmount>
                     <currency>?</currency>
                     <amount>?</amount>
                  </totalAmount>
                  <complimentaryTicket>?</complimentaryTicket>
                  <!--Optional:-->
                  <complimentaryTicketDetail>
                     <!--Optional:-->
                     <comment>?</comment>
                     <!--Optional:-->
                     <reason>?</reason>
                     <!--Optional:-->
                     <validityPeriod>
                        <!--Optional:-->
                        <endDate>?</endDate>
                        <!--Optional:-->
                        <startDate>?</startDate>
                     </validityPeriod>
                  </complimentaryTicketDetail>
                  <!--Optional:-->
                  <ticketUsagePeriod>
                     <!--Optional:-->
                     <endDate>?</endDate>
                     <!--Optional:-->
                     <startDate>?</startDate>
                  </ticketUsagePeriod>
               </ticketDetail>
            </updatePartyMixDetail>
            <!--Optional:-->
            <upgradeChargeDetail>
               <!--Optional:-->
               <authorizationCode>?</authorizationCode>
               <!--Optional:-->
               <chargeToGuest>?</chargeToGuest>
               <!--Optional:-->
               <noCharge>?</noCharge>
            </upgradeChargeDetail>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </acc:upgradePartyMix>
   </soapenv:Body>
</soapenv:Envelope>
